In [27]:
import pandas as pd
df=pd.DataFrame()
print(df)
emp=pd.Series(['Parker','John','Smith','William'])
id=pd.Series([102,107,109,114])
frame={'Emp':emp,'ID':id}
result=pd.DataFrame(frame)
print("\nSeries to Data frame\n")
print(result)
print("\nExtracting one column:\n")
print(result['Emp'])
print("\nAdding new column:\n")
result['Age']=pd.Series([35,24,40,38])
print(result)
print("\nDeleting one column:\n")
del result['Age']
print(result)
print("\nExtracting the third row:\n")
print(result.loc[2])
print("\nSlice rows:\n",result[1:3])
d2=pd.DataFrame([['Dale',123],['Mark',143]],columns=['Emp','ID'])
result=pd.concat([result,d2],ignore_index=True)
print("\nAdding new row values:\n",result)
print("\nDeleting particular row:\n",result.drop(1))

Empty DataFrame
Columns: []
Index: []

Series to Data frame

       Emp   ID
0   Parker  102
1     John  107
2    Smith  109
3  William  114

Extracting one column:

0     Parker
1       John
2      Smith
3    William
Name: Emp, dtype: object

Adding new column:

       Emp   ID  Age
0   Parker  102   35
1     John  107   24
2    Smith  109   40
3  William  114   38

Deleting one column:

       Emp   ID
0   Parker  102
1     John  107
2    Smith  109
3  William  114

Extracting the third row:

Emp    Smith
ID       109
Name: 2, dtype: object

Slice rows:
      Emp   ID
1   John  107
2  Smith  109

Adding new row values:
        Emp   ID
0   Parker  102
1     John  107
2    Smith  109
3  William  114
4     Dale  123
5     Mark  143

Deleting particular row:
        Emp   ID
0   Parker  102
2    Smith  109
3  William  114
4     Dale  123
5     Mark  143